# Analiza i Bazy Danych
## Karol Musiał, grupa 3a
### Laboratorium 5
## "Wyrażenia regularne"

In [1]:
import main
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

### <b>1. Znajdź wszystkie nazwy krajów rozpoczynających się na P.<b>

In [26]:
df = pd.read_sql("SELECT country.country Country FROM country WHERE country.country ~ '^P'", con=connection)
df

       country
0     Pakistan
1     Paraguay
2         Peru
3  Philippines
4       Poland
5  Puerto Rico

### <b>2. Znajdź wszystkie nazwy krajów rozpoczynających się P i kończących na s.<b>

In [30]:
df = pd.read_sql("SELECT country.country Country FROM country WHERE country.country ~ '(^P)[a-z]{0,}(s$)'", con=connection)
df

       country
0  Philippines

### <b>3. Znajdź wszystkie tytuły filmów, w których znajdują się cyfry.<b>

In [41]:
df = pd.read_sql("SELECT film.title Title FROM film WHERE film.title ~ '\d'", con=connection)
df

Empty DataFrame
Columns: [title]
Index: []

### <b>4. Znajdź wszystkich pracowników z podwójnym imieniem lub nazwiskiem.<b>

In [43]:
df = pd.read_sql("SELECT staff.first_name, staff.last_name FROM staff WHERE staff.last_name ~ '[a-zA-Z]{0,}(\s|-)[a-zA-Z]{0,1}'", con=connection)
df

Empty DataFrame
Columns: [first_name, last_name]
Index: []

### <b>5. Znajdź wszystkie nazwiska aktorów rozpoczynających się od P lub C i mających 5 znaków.<b>

In [57]:
df = pd.read_sql("SELECT actor.first_name, actor.last_name FROM actor WHERE actor.last_name ~ '^(P|C)[a-zA-Z]{4}$'", con=connection)
df

  first_name last_name
0         Ed     Chase
1       Burt     Posey
2    Kenneth     Pesci
3     Sidney     Crowe
4        Jon     Chase
5    Russell     Close

### <b>6. Znajdź wszystkie tytuły filmów, w których występują słowa Trip lub Alone.<b>

In [60]:
df = pd.read_sql("SELECT film.title FROM film WHERE film.title ~* '(\s{1}|^)(Trip|Alone)(\s{1}|$)'", con=connection)
df

           title
0     Alone Trip
1  Superfly Trip
2    Trip Newton
3   Varsity Trip

### <b>7. Przeanalizuj zapytanie: select first_name from actor where first_name ~ '^ Al[a: z, 1: 9] *'<b>

In [67]:
df = pd.read_sql("SELECT first_name FROM actor WHERE first_name ~ '^ A|[a: z, 1: 9]*' ", con=connection)
df

    first_name
0     Penelope
1         Nick
2           Ed
3     Jennifer
4       Johnny
..         ...
195       Bela
196      Reese
197       Mary
198      Julia
199      Thora

[200 rows x 1 columns]

#### <b>Powyższe zapytania zwraca aktorów których imiona zaczynają się od 'A' lub <b>

### <b>8. Przeanalizuj zapytanie: select first_name from actor where first_name ~ '^ al[a: z, 1: 9] '<b>

In [63]:
df = pd.read_sql("SELECT first_name FROM actor WHERE first_name ~'^ a|[a: z, 1: 9]'", con=connection)
df

   first_name
0       Grace
1     Matthew
2   Christian
3        Karl
4         Uma
..        ...
92      Jayne
93       Bela
94       Mary
95      Julia
96      Thora

[97 rows x 1 columns]

## ZADANIA IMPLEMENTACYJNE

### FUNKCJA 1 - Zapytanie o film, podajac ID jego kategorii lub jej nazwę.

In [18]:
main.film_in_category('action')

Empty DataFrame
Columns: [title, languge, category]
Index: []

### FUNKCJA 2 - Rozszerzona wersja powyższej funkcji.

In [17]:
main.film_in_category_case_insensitive('action')

                     title               languge category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

### FUNKCJA 3 - Zapytanie o aktorów grających w filmie o podanej nazwie.

In [19]:
main.film_cast('Worst Banger')

  first_name last_name
0    Kirsten    Akroyd
1    Matthew    Carrey
2    Spencer      Depp
3     Parker  Goldberg

### FUNKCJA 4 - Zapytanie o film który w tytule zawiera jedno ze słów z wejściowej listy.

In [24]:
main.film_title_case_insensitive(['DraCula', 'Spirit', 'CRYSTAL', 'Women', 'americAn'])

                title
0     American Circus
1   Conspiracy Spirit
2    Crystal Breaking
3     Dracula Crystal
4  Spirit Flintstones
5        Women Dorado